mfmayer/level-sensor-nrf51/main.c
/**
 * Copyright (c) 2014 - 2017, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_app_beacon_main main.c
 * @{
 * @ingroup ble_sdk_app_beacon
 * @brief Beacon Transmitter Sample Application main file.
 *
 * This file contains the source code for an Beacon transmitter sample application.
 */

#include <stdbool.h>
#include <stdint.h>
#include "ble_advdata.h"
#include "nordic_common.h"
#include "softdevice_handler.h"
#include "bsp.h"
#include "app_timer.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_drv_adc.h"

#define CENTRAL_LINK_COUNT 0    /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT 0 /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define IS_SRVC_CHANGED_CHARACT_PRESENT 0 /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/

#define APP_CFG_NON_CONN_ADV_TIMEOUT 0                                  /**< Time for which the device must be advertising in non-connectable mode (in seconds). 0 disables timeout. */
#define NON_CONNECTABLE_ADV_INTERVAL MSEC_TO_UNITS(5000, UNIT_0_625_MS) /**< The advertising interval for non-connectable advertisement (100 ms). This value can vary between 100ms to 10.24s). */

// #define APP_BEACON_INFO_LENGTH 0x17   /**< Total length of information advertised by the Beacon. */
// #define APP_ADV_DATA_LENGTH 0x15      /**< Length of manufacturer specific data in the advertisement. */
// #define APP_DEVICE_TYPE 0x02          /**< 0x02 refers to Beacon. */
// #define APP_MEASURED_RSSI 0xC3        /**< The Beacon's measured RSSI at 1 meter distance in dBm. */
// #define APP_COMPANY_IDENTIFIER 0xFFFF /**< Company identifier for Nordic Semiconductor ASA. as per www.bluetooth.org. */
// #define APP_MAJOR_VALUE 0x01, 0x02    /**< Major value used to identify Beacons. */
// #define APP_MINOR_VALUE 0x03, 0x04    /**< Minor value used to identify Beacons. */
// #define APP_BEACON_UUID 0x01, 0x12, 0x23, 0x34, 0x45, 0x56, 0x67, 0x78, 0x89, 0x9a, 0xab, 0xbc, 0xcd, 0xde, 0xef, 0xf0 /**< Proprietary UUID for Beacon. */

#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define APP_TIMER_PRESCALER 0     /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE 4 /**< Size of timer operation queues. */

// #if defined(USE_UICR_FOR_MAJ_MIN_VALUES)
// #define MAJ_VAL_OFFSET_IN_BEACON_INFO 18 /**< Position of the MSB of the Major Value in m_beacon_info array. */
// #define UICR_ADDRESS 0x10001080          /**< Address of the UICR register used by this example. The major and minor versions to be encoded into the advertising data will be picked up from this location. */
// #endif

static ble_gap_adv_params_t m_adv_params; /**< Parameters to be passed to the stack when starting advertising. */
// static uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH] = /**< Information advertised by the Beacon. */
//     {
//         APP_DEVICE_TYPE,     // Manufacturer specific information. Specifies the device type in this
//                              // implementation.
//         APP_ADV_DATA_LENGTH, // Manufacturer specific information. Specifies the length of the
//                              // manufacturer specific data in this implementation.
//         APP_BEACON_UUID,     // 128 bit UUID value.
//         APP_MAJOR_VALUE,     // Major arbitrary value that can be used to distinguish between Beacons.
//         APP_MINOR_VALUE,     // Minor arbitrary value that can be used to distinguish between Beacons.
//         APP_MEASURED_RSSI    // Manufacturer specific information. The Beacon's measured TX power in
//                              // this implementation.
// };

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t err_code;
    ble_advdata_t advdata;

    ble_advdata_manuf_data_t manuf_specific_data;
    manuf_specific_data.company_identifier = 0xFFFF;

    // manuf_specific_data.company_identifier = APP_COMPANY_IDENTIFIER;

    // #if defined(USE_UICR_FOR_MAJ_MIN_VALUES)
    //     // If USE_UICR_FOR_MAJ_MIN_VALUES is defined, the major and minor values will be read from the
    //     // UICR instead of using the default values. The major and minor values obtained from the UICR
    //     // are encoded into advertising data in big endian order (MSB First).
    //     // To set the UICR used by this example to a desired value, write to the address 0x10001080
    //     // using the nrfjprog tool. The command to be used is as follows.
    //     // nrfjprog --snr <Segger-chip-Serial-Number> --memwr 0x10001080 --val <your major/minor value>
    //     // For example, for a major value and minor value of 0xabcd and 0x0102 respectively, the
    //     // the following command should be used.
    //     // nrfjprog --snr <Segger-chip-Serial-Number> --memwr 0x10001080 --val 0xabcd0102
    //     uint16_t major_value = ((*(uint32_t *)UICR_ADDRESS) & 0xFFFF0000) >> 16;
    //     uint16_t minor_value = ((*(uint32_t *)UICR_ADDRESS) & 0x0000FFFF);

    //     uint8_t index = MAJ_VAL_OFFSET_IN_BEACON_INFO;

    //     m_beacon_info[index++] = MSB_16(major_value);
    //     m_beacon_info[index++] = LSB_16(major_value);

    //     m_beacon_info[index++] = MSB_16(minor_value);
    //     m_beacon_info[index++] = LSB_16(minor_value);
    // #endif

    manuf_specific_data.data.p_data = (uint8_t[]){0x11, 0x22, 0x33, 0x44};
    manuf_specific_data.data.size = 4;

    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type = BLE_ADVDATA_NO_NAME;
    advdata.flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    err_code = ble_advdata_set(&advdata, NULL);
    APP_ERROR_CHECK(err_code);

    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

    m_adv_params.type = BLE_GAP_ADV_TYPE_ADV_NONCONN_IND;
    m_adv_params.p_peer_addr = NULL; // Undirected advertisement.
    m_adv_params.fp = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval = NON_CONNECTABLE_ADV_INTERVAL;
    m_adv_params.timeout = APP_CFG_NON_CONN_ADV_TIMEOUT;
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code;
    err_code = sd_ble_gap_tx_power_set(4);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_adv_start(&m_adv_params);
    APP_ERROR_CHECK(err_code);

    // err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    // APP_ERROR_CHECK(err_code);
}

static void advertising_stop(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_stop();
    APP_ERROR_CHECK(err_code);

    // err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    // APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);
}

static void ble_set_manufacturer_data(uint16_t value)
{
    uint32_t err_code;
    ble_advdata_t advdata;

    ble_advdata_manuf_data_t manuf_specific_data;

    // static uint8_t cnt = 0;
    // cnt++;
    uint8_t low = value & 0xff;
    uint8_t high = (value >> 8) & 0xff;
    manuf_specific_data.company_identifier = 0xFFFF;

    manuf_specific_data.data.p_data = (uint8_t[]){0x11, 0x22, high, low};
    manuf_specific_data.data.size = 4;

    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type = BLE_ADVDATA_NO_NAME;
    advdata.flags = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    err_code = ble_advdata_set(&advdata, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for doing power management.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

uint32_t ticks_per_100ms = APP_TIMER_TICKS(100, APP_TIMER_PRESCALER);
#define MS_TO_TICK(TICKS_PER_100MS, MS) (TICKS_PER_100MS * (MS / 100))

// static nrf_drv_adc_channel_t m_channel_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_2); /**< Channel instance. Default configuration used. */
static nrf_drv_adc_channel_t m_channel_config = {
    {{.resolution = NRF_ADC_CONFIG_RES_10BIT,
      .input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD,
      .reference = NRF_ADC_CONFIG_REF_VBG,
      .ain = (NRF_ADC_CONFIG_INPUT_2)}},
    NULL};

static void
timer_handler(void *p_context)
{
    static uint8_t cnt = 0;
    nrf_adc_value_t adc_value = 0;
    cnt++;
    // ble_set_manufacturer_data(cnt);
    if (cnt % 2 == 0)
    {
        // advertising_start();
        nrf_gpio_pin_set(13);
        // ble_set_manufacturer_data(1);
        // nrf_gpio_pin_write(13, 1);
    }
    else
    {
        // advertising_stop();
        nrf_gpio_pin_clear(13);
        // ble_set_manufacturer_data(0);
        // nrf_gpio_pin_write(13, 0);
    }
    nrf_drv_adc_sample_convert(&m_channel_config, &adc_value);
    ble_set_manufacturer_data(adc_value);
    // advertising_start();
    // ble_set_manufacturer_data();
}

static void timer_init(void)
{
    APP_TIMER_DEF(sleep_timer_id);
    app_timer_create(&sleep_timer_id, APP_TIMER_MODE_REPEATED, timer_handler);
    app_timer_start(sleep_timer_id, MS_TO_TICK(ticks_per_100ms, 5000), NULL);
}

#define ADC_BUFFER_SIZE 10                          /**< Size of buffer for ADC samples.  */
static nrf_adc_value_t adc_buffer[ADC_BUFFER_SIZE]; /**< ADC buffer. */

/**
 * @brief ADC interrupt handler.
 */
static void adc_event_handler(nrf_drv_adc_evt_t const *p_event)
{
    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
    {
        uint32_t i;
        for (i = 0; i < p_event->data.done.size; i++)
        {
            NRF_LOG_INFO("Current sample value: %d\r\n", p_event->data.done.p_buffer[i]);
        }
    }
}

/**
 * @brief ADC initialization.
 */
static void adc_config(void)
{
    ret_code_t ret_code;
    nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;

    // ret_code = nrf_drv_adc_init(&config, adc_event_handler);
    ret_code = nrf_drv_adc_init(&config, NULL);
    APP_ERROR_CHECK(ret_code);

    // nrf_drv_adc_channel_enable(&m_channel_config);
}

/**
 * @brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, 0);
    // err_code = bsp_init(BSP_INIT_NONE, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), NULL);
    // APP_ERROR_CHECK(err_code);
    // nrf_gpio_cfg_output(13);
    // nrf_gpio_pin_write(13, 0);
    ble_stack_init();
    advertising_init();
    adc_config();
    timer_init();

    // Start execution.
    NRF_LOG_INFO("BLE Beacon started\r\n");
    advertising_start();

    nrf_gpio_cfg_output(13);

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}

/**
 * @}
 */
